{
    "title": "Artificial Intelligence and Machine Learning",
    "body": "# **Artificial Intelligence and Machine Learning**\n\n## **Artificial Intelligence**\n\nJohn McCarthy offers the following definition in this 2004 paper:\n\n\\\"It is the science and engineering of making intelligent machines,\nespecially intelligent computer programs. It is related to the similar\ntask of using computers to understand human intelligence, but AI does\nnot have to confine itself to methods that are biologically\nobservable.\\\"\n\nIt has been existent for a long time, and originated from Alan Turing\\'s\n1950 work \"Computer Machinery and Intelligence\".\n\nArtificial Intelligence makes use of computers, its extended\ntechnologies and tools, to mimic human intelligence/logic as well as our\ndecision making.\n\nIt applies computer science with robust datasets to achieve\nproblem-solving through multiple methodologies in today's industry. It\nconsists of two subfields within it that have become synonymous with the\nterm AI/Artificial Intelligence: Machine learning and Deep Learning.\n\nThese subfields make use of AI algorithms to provide classifications or\npredictions based on the input data provided. They have improved the\nquality and usage experience of multiple expert systems and made it\neasier to create them as well.\n\n#### Two types of Artificial Intelligence exist: \n\n-   #### [Weak AI]{.ul}: Although termed as weak, weak AI is actually used to power most of the prevalent encounters with AI in the modern world. They are AI geared towards a specific task, and include applications such as Siri, etc.\n\n-   #### [Strong AI]{.ul}: This type consists of AGI (Artificial General Intelligence) and ASI (Artificial Super Intelligence). AGI is an AI system that's equivalent to human systems. ASI is an AI system that far exceeds human intelligence and can be categorized as exponentially growing in its intelligence levels. Strong AI are currently theoretical in nature.\n\n## **Machine Learning**\n\nA computer is said to be learning from **Experiences** with respect to\nsome class of **Tasks** if its performance in a given task improves with\nthe Experience. For example, consider a computer playing chess. The\nperformance metric to be measured can be the percentage of chess games\nwon. The **Experience** in this instance is 'playing chess games', the\n**task** is playing chess games against itself, and the **performance\nmeasure** is percentage of games\nwon.![](components/articles/artificial-intelligence/assets/image1.png){width=\"2.6195319335083114in\"\nheight=\"2.6195319335083114in\"}\n\nThat definition is the foundation over which the field of Machine\nLearning is built and propagated. Machine learning works by taking past\ndata of a format that is suitable for processing. It is necessary for\nthe data to be of high quality, since higher the quality of data\nacquired, the better it shall be for modeling.\n\nOne might need to do some data processing on the data sets, in order to\nensure there are no missing values, the form of data is appropriate, and\nto reduce the amount of noise/inaccuracy in the data. One has to try to\nmake the dataset as relevant to the requirements as possible.\n\nFollowing this, the input data is divided into training,\ncross-validation, and test sets. The ratio between the respective sets\nmust be 6:2:2.\n\nOnce the division of input data has taken place, the models are built\nthrough appropriate algorithms and techniques on the training set.\n\nThe final step involves testing the conceptualized model using training\ndata that wasn't fed into the model initially and measuring the\nperformance on the basis of metrics such as F1 score, precision, etc.\n\n#### [Difference between traditional programming and machine learning]{.ul}\n\n![](components/articles/artificial-intelligence/assets/image2.png){width=\"4.145833333333333in\"\nheight=\"1.6208661417322834in\"}\n\n-   As can be referenced from the above image, in **traditional\n    > programs** we feed in the input and the logic/program and we\n    > obtain the output accordingly.\n\n-   In **Machine learning**, however, we feed in the Data/input obtained\n    > from the training set, along with the output from the previous\n    > cycle, or the expected output. The algorithm produces its own\n    > program which is then tested for performance.\n\n#### [Classification of Machine Learning]{.ul}\n\n-   **Supervised learning:**\n\n    -   *Supervised learning is the machine learning task of learning a\n        > function that maps an input to an output based on example\n        > input-output pairs. The given data is labeled . Both\n        > classification and regression problems are supervised learning\n        > problems.*\n\n    -   Example: Consider data of teenagers. The data consists of the\n        > gender and age of each teenager and each teenager is labeled\n        > as 'student' or 'non-student'\n\n-   **Unsupervised learning:**\n\n    -   *Unsupervised learning is a type of machine learning algorithm\n        > used to draw inferences from datasets consisting of input data\n        > without labeled responses. In unsupervised learning\n        > algorithms, classification or categorization is not included\n        > in the observations.*\n\n    -   Hence, for our previous example of data of teenagers, the data\n        > would be given, and a correlation within the data would be\n        > inferred by the algorithm itself.\n\n-   **Reinforcement learning:**\n\n    -   *Reinforcement learning is the problem of getting an agent to\n        > act in the world so as to maximize its rewards.*\n\n    -   A learner is not told what actions to take as in most forms of\n        > machine learning but instead must discover which actions yield\n        > the most reward by trying them. For example --- Consider\n        > teaching a dog a new trick: we cannot tell it what to tell it\n        > to do what to do, but we can reward/punish it if it does the\n        > right/wrong thing.\n\n-   **Semi-supervised learning**\n\n    -   *Semi-supervised learning is an approach to machine learning\n        > that combines small labeled data with a large amount of\n        > unlabeled data during training. Semi-supervised learning falls\n        > between unsupervised learning and supervised learning.*\n\n## **Applications of Artificial Intelligence**\n\nSome of the application of Artificial intelligence/Machine learning are\nas follows:\n\n-   **Speech Recognition:** One of the most common and extensive\n    > applications of AI, speech recognition makes use of NLP to convert\n    > human speech into an understandable format, which is then refined,\n    > processed and converted into written format if needed. An example\n    > of this would be Siri or the Amazon echo.\n\n-   **Computer vision:** CV has been on the rise in recent years,\n    > especially with the popularization of tesla, and its self driving\n    > feature. It is the process wherein visual data such as from videos\n    > and images, and then processing it to take the appropriate action\n    > on the obtained data. Powered by convolutional neural networks,\n    > computer vision has applications in photo tagging on social media,\n    > radiology imaging in healthcare, and self-driving cars within the\n    > automotive industry.\n\n-   **Fraud detection:** Banks and other financial institutions make use\n    > of AI and ML to capture fraud and have a robust fraud detection\n    > system, which allows them to promise more secure services, and\n    > reduces the probability of a fraud, especially due to rising fraud\n    > numbers in recent times.\n\n-   **Customer service:** Usage of AI/ML based online chatbots has\n    > become quite popular and is cost intensive, since it allows one to\n    > run their business without having to hire a customer service\n    > agent. Due to the improvements in AI/ML technologies, the service\n    > offered by these chatbots its quite extensive, and satisfactory.\n    > This domain seems to only be growing with improved datasets\n    > collected from previous usage and improvement in algorithm\n    > implementations.\n\n## \n\n## \n\n## **Advantages of AI/ML**\n\n-   **Reduced errors:** One of the advantages of establishing an AI/ML\n    > model and then using it for your processes is that it reduces the\n    > manual interference required for data-processing and onboarding.\n    > This results in lowering of manual errors and remedial tasks\n    > becoming background processes, which makes the entire process more\n    > efficient and less error-prone.\n\n-   **Automation:** With increased adoption of AI/ML, there is an\n    > increase in automation of most trivial tasks as well as tasks that\n    > are business facing. AI can be used to automate most tasks with\n    > quite good results, leading into cost effectiveness, and better\n    > business processes.\n\n-   **Better customer experience:** With usage of online ML based\n    > chatbots, the speedy resolution of a customer's query results in\n    > better satisfaction in comparison to having to call and wait for\n    > the customer care to get back to you. Furthermore, the automation\n    > of the process, including calling a customer care representative\n    > in case needed, makes the entire experience much more satisfactory\n    > and seamless.\n\n-   **Decision making:** Although humans do not lack decision making,\n    > they do lack the ability to process high amounts of information\n    > with high degree of accuracy. However, AI models can take large\n    > datasets, make meaning out of them, and produce data trends,\n    > forecasts and predictions without the human factor of emotions\n    > involved, resulting in far more accuracy and preciseness.\n\n## **Future of AI/ML**\n\nAlthough AGI and ASI are still a long way off, there is an increased\nadoption in AI/ML pipeline by businesses in their processes, and to\nsolve certain challenges in the short term.\n\nWith improvement in NLP technologies and increased sophistication, they\nare being used in multiple business processes that make use of speech\nprocessing, and are a part of multiple chatbot services currently being\nused by customer care oriented businesses.\n\nGartner predicts that 50% of enterprises will have platforms to\noperationalize AI by 2025 (a sharp increase from 10% in 2020).\n\nHence, although hyped at times, it is a growing and in-demand technology\nthat is well-worth learning as a specialization and allowing you to grow\nas a computer science enthusiast.\n\n## **Resources for learning ML:**\n\n-   [[https://www.kaggle.com/general/274909]{.ul}](https://www.kaggle.com/general/274909)\n\n-   [[https://serokell.io/blog/top-resources-to-learn-ml]{.ul}](https://serokell.io/blog/top-resources-to-learn-ml)\n\n-   [[https://www.deepwizai.com/roadmap/ml-roadmap]{.ul}](https://www.deepwizai.com/roadmap/ml-roadmap)\n",
    "author": "Sanskar Pandey",
    "email": "sanskarpandey0@gmail.com",
    "date": "04/10/2022",
    "references": [
      "https://www.ibm.com/cloud/learn/what-is-artificial-intelligence",
      "https://www.sailpoint.com/identity-library/benefits-of-ai-and-machine-learning/",
      "https://www.geeksforgeeks.org/ml-machine-learning/"
    ]
  }
