{
    "title": "RoadMap to Android Development",
    "body": "# **Roadmap to Application to Android Development**\r\n\r\n### Since this is a roadmap, we will study the fundamentals through the following different topics to master this topic:\r\n\r\n> *What programming Language Should You Learn*\r\n\r\n> *Where Can you learn about your selected Language*\r\n\r\n## **what is app/application?**\r\n\r\n> An App/Application is a software which can be installed and run on a computer, tablet, smartphone, etc.\r\n\r\n## **What is Android and from where it started?**\r\n\r\n> Android is an open-source operating system, based on the Linux kernel and used in mobile devices like smartphones, tablets, etc. Android has been one of the best-selling OS for smartphones. Android OS was developed by Android Inc. which Google bought in 2005. Various applications like games, music player, camera, etc. are built for these smartphones for running on Android. Google Play Store features quite 3.3 million apps. Today, Android remains dominant on a global scale. Approximately 75% of the world population prefers using Android as against 15% of iOS. It is an operating system that has a huge market for apps.\r\n### **Now, we are familiar with the word app and Android.**\r\n\r\n## **why Android Development?**\r\n\r\nIt’s time to see your goals what is the goal for your android development:-\r\n\r\n>- It might be for academic purposes, for making college projects\r\n>- It might be for your long-term career\r\n>- It might be for teaching purpose, in this case your learning the development to teach\r\n\r\n> **_How to choose and What to choose as your language?_** \r\n\r\n> **Java**\r\n\r\n> > Java is an official language of Android development and is supported by Android Studio It has been an official language longer than Kotlin, and it is also popular outside of Kotlin development for many other purposes. Java and Android Studio have a steep learning curve.\r\n\r\n> **Kotlin**\r\n\r\n> > Kotlin is another official Android language. It is similar to Java in many ways but is a little easier to get your head around. It is also now Google’s preferred language of choice, though it is not as widely used outside of Android Studio. This may make it slightly less appealing for those hoping to work as developers across numerous projects.\r\n\r\n>  **Dart Programming**\r\n\r\n> > Dart is an open-source general-purpose programming language developed by Google. It supports application development in both client and server-side. But is widely used for the development of Android apps, ios apps, IoT, and web applications using the Flutter Framework.\r\n\r\n>  **C++**\r\n\r\n> > Android Studio also supports C++ with the use of the Java NDK. This allows for native coding applications, which can be handy for things like games. C++ is more complicated though, and this option is mostly only going to appeal to large, professional teams. C++ is also supported by Unreal Engine.\r\n\r\n>  **C#**\r\n\r\n> > C# is a more beginner-friendly alternative to C or C++ that obfuscates more code. It is also a little less difficult than Java, though the two languages are extremely similar. It’s supported by some very handy tools like Unity and Xamarin, which are great for game development and cross-platform development. C# with Unity is the best option for many mobile game developers.\r\n\r\n<!-- ![RoadMap to android development](./Assets/AndroidDevRoadMap.png \"Flowchart for Android Development\") -->\r\n<center><img src=\"./Assets/AndroidDevRoadMap.png\" width=\"500\" height=\"1000\" alt=\"RoadMap to android development\"></center>\r\n\r\n## **In this RoadMap we wil be discussing on Java, Kotlin and Dart**\r\n\r\n### **_Java_**\r\n\r\nFirstly Java was the official language for Android App Development (but now it was replaced by Kotlin) and consequently, it is the most used language as well. Many of the apps in the Play Store are built with Java, and it is also the most supported language by Google. In addition to all this, Java has a great online community for support in case of any problems (And trust me, there will be problems!).\r\nHowever, Java is a complicated language for a beginner to use as it contains complex topics like constructors, null pointer exceptions, concurrency, checked exceptions, etc. Also, The Android Software Development Kit (SDK) increases the complexity to a new level!\r\nAll in all, Java is a great language to experience the full joys of Android App Development. However, it may be a little complex for beginners who would prefer to start with something easier and then return to it.\r\n\r\n#### **Resources to learn:**\r\n\r\n> [Udemy](https://www.udemy.com/share/103nJu/)\r\n\r\n> [FreeCodeCamp](https://youtu.be/fis26HvvDII)\r\n\r\n### **_Kotlin_**\r\n\r\nNow Kotlin is the official language for Android App Development declared by Google in 2019. Kotlin is a cross-platform programming language that may be used as an alternative to Java for Android App Development. It has also introduced as a secondary “official” Java language in 2017. Kotlin can interoperate with Java and it runs on the Java Virtual Machine.\r\nThe only sizable difference is that Kotlin removes the superfluous features of Java such as null pointer exceptions. It also removes the necessity of ending every line with a semicolon. In short, Kotlin is much simpler for beginners to try as compared to Java and it can also be used as an “entry point” for Android App Development.\r\n\r\n#### **Resources to learn:**\r\n\r\n> [Udacity](https://www.udacity.com/course/developing-android-apps-with-kotlin--ud9012)\r\n\r\n> [Google Developers](https://developer.android.com/courses/android-basics-kotlin/course)\r\n\r\n### **_Dart_**\r\n\r\nDart is an open-source programming language that powers the Flutter framework, which is getting a lot of traction these days because of its ability to deliver beautiful and performance apps for the web, desktop, and mobile in lesser time. The key selling point of dart is that it is designed by Google as a client-optimized language for fast apps on any platform. Dart mainly focuses on making UI development easier for developers with features such as hot-reload, which lets developers see changes instantly while working on the app. Dart is also known for its fast performance, it compiles to ARM and x64 machine code for mobile, desktop, and backend. Flutter is a cross-platform app development frameworks, Flutter is more cost-effective. It meets all the requirements of every company, regardless of its model and size.\r\n\r\n#### **Resources to learn:**\r\n\r\n> [FreeCodeCamp](https://youtu.be/VPvVD8t02U8)\r\n\r\n> [Udemy](https://www.udemy.com/share/101WB6/)\r\n\r\n## **Getting Familiar With Android Studio**\r\n\r\nIt’s better to know your tools before you are going to use it. Android Studio is the official Integrated Development Environment for Google’s Android operating system, built on JetBrains’ IntelliJ IDEA software and designed specifically for Android development.\r\n\r\n### **_File Structure:_**\r\n\r\n> AndroidManifest.xml file\r\n> Java file\r\n> Drawable file\r\n> Layout file\r\n> mipmap file\r\n> colors.xml file\r\n> strings.xml file\r\n> styles.xml file\r\n> build.gradle(Module: app) file\r\n\r\n### **_Android Studio Overview:_**\r\n\r\n> Create a new project\r\n> Reopen, close, save the project\r\n> Create a new activity, classes, drawable resource files\r\n> Run the app on AVD of Emulator or in a real device etc.\r\n\r\n## **Android Operating system**\r\n\r\nThe foundation of the Android Platform is the Linux Kernel, which allows Android to take advantage of certain security features. The Linux kernel has been used in millions of security-sensitive systems since its creation in 1991, so it has a long history of consistently being researched, tested, and improved upon by thousands of developers.\r\n\r\n> According to the android Docs, Android utilizes several key Linux security features including:\r\n> A user-based permissions model\r\n> Process isolation\r\n> An extensible mechanism for secure inter-process communication (IPC)\r\n> The ability to remove unnecessary and/or insecure parts of the kernel\r\n\r\n## **Conclusion**\r\n\r\nThis concludes the RoadMap to android Development. From why to learn where to start and how to start. From choosing a language for the Development and benefits of using that langugae\r\nAgain, don't be intimidated by the amount of information on this roadmap. Check out the sections that would be the most helpful to you to understand Android development, as “the more Research the more you Learn”.\r\nAlso, you don’t have to learn all there is to know about the Android operating system. However, understanding the overall Android platform architecture will definitely help you to build better Android applications.\r\n",
    "author": "Niraj Modi",
    "email": "modiniraj1034@gmail.com",
    "date": "<06/10/2022>",
    "references": [
      "https://www.geeksforgeeks.org/best-way-to-become-android-developer-a-complete-roadmap/",
      "https://getstream.io/blog/android-developer-roadmap/",
      "https://youtu.be/VaMWsm6CFss"
    ]
  }