{
    "title": "Introduction to Quantum Bits & Quantum Computing",
    "body": "# **Introduction to Quantum Bits & Quantum Computing**\n\n## Qubit\n\nA Qubit can be defined as the most fundamental piece of information in\nquantum computing, and the quantum computer equivalent of a binary bit,\nused in classical computers. Quantum computers make use of the concept\nof quantum superposition to arrive at the states/values held by a qubit,\nhence making it relevant to understand quantum superpositioning briefly.\n\n### Quantum Superpositioning:\n\n![](components/articles/quantum-computing/assets/image1.gif){width=\"6.5in\"\nheight=\"3.6944444444444446in\"}\n\nThe above video illustration gives an overview of how quantum\nsuperposition can be understood to occur. A qubit can exist as a 1\n**AND** a 0, rather than 1 **OR** 0 like in a bit. Until a measurement\nof the state takes place, to determine the value/state of a qubit, its\nvalue is both, 1 and 0, through the concept of quantum superposition.\nThis allows a qubit to hold multiple values, rather than a single value,\nallowing for faster, and larger computations.\n\nQuantum superpositioning is prevalent throughout nature, and can be\nobserved in natural computations such as chemical reactions, which are\nintrinsically fast due to the quantum superpositioning taking place at a\nsubatomic level.\n\n### Qubit Life-Cycle\n\nNow that we realize qubits use quantum superposition to be in between\ntwo states of 1 and 0, and are not just a definite 1 or a 0 like a\nclassical binary bit, let's represent this mathematically. **Consider a\npure qubit \\|ψ⟩. It is represented by the linear combination of two\nbasis states 1 and 0.** (Let's represent the basis states as \\|1⟩ and 0⟩\nrespectively)\n\n\\|ψ⟩ = α \\|0⟩ + β \\|1⟩, where α, β ∈ \\[0,1\\], such that \\|α\\|² + \\|β\\|²\n= 1\n\nSince it can be observed that α and β have values between \\[0,1\\], they\ncan take an infinite number of values, with the values corresponding to\na unit circle, and including real values. Consequently, a qubit too can\ntake an infinite number of values due to this. Hence, it becomes\nnecessary to switch to Vector Spaces to further our discussion of the\nqubit.\n\nA simple qubit life-cycle can be broken down into three overarching\nsteps as follows:\n\n1.  On initialization of a qubit, it either starts in one of the pure\n    > \\|0⟩ or \\|1⟩ state. It is then subjected to superpositioning\n    > through the usage of a quantum gate/operation.\n\n2.  All computation is then carried out in this superpositioned\n    > (combination of the above two pure states) state.\n\n3.  On completion of the computation, we measure them back into one of\n    > the original basic states of \\|0⟩ or \\|1⟩ from step 1.\n\nIt is in the 3rd step that we introduce measuring of the qubit. When the\nqubit is measured, in accordance with the principles of quantum\nsuperpositioning, it lands up in one of the possible basis vector states\nof \\|0⟩ or \\|1⟩. The probability of the qubit having a certain basis\nstate is equal to the square of the coefficient of the state as shown\nbelow.\n\nP(\\|ψ⟩ = \\|0⟩) =γ²\n\nP(\\|ψ⟩ = \\|1⟩) =δ²\n\n![](components/articles/quantum-computing/assets/image3.png){width=\"6.5in\"\nheight=\"1.5in\"}\n\n## \n\n## Qubit vs Bit\n\nModern classical computers make use of the Binary bit as their\nfundamental piece of information. Bit is binary in nature, consisting of\nonly two values, 1 and 0. Based on the same switch logic as those of\nlogic gates, bits combine their values of 1 and 0s as a group, and carry\nout various operations of representing, conveying and manipulating data.\nBits are slow and multiple bits are required to complete the simplest\nequations on a classical computer.\n\nA Qubit, on the other hand, is the basic unit of quantum computing or\nquantum information. It is to quantum computers and computing, what the\nBit is to classical computers and computation.\n\nAt any given moment, a bit holds only one value and it is possible to\nfully encode one bit into one qubit. However, the implementation of the\nqubit allows it to store more information, such as two bits using\nsuperdense coding.\n\nThis is achieved through application of quantum superposition, which\nallows for a coherent superposition of both states, allowing the value\nto exist as a 1 or a 0 until the state is measured. On measuring the\nstate of a qubit, the superposition is disturbed, which is unlike a bit\n, where the state remains undisturbed on observance/measurement.\n\n> ![](components/articles/quantum-computing/assets/image2.png){width=\"5.765625546806649in\"\n> height=\"3.170135608048994in\"}\n\n## Advantages of Quantum Computing over Classical Computing\n\nThe power of Quantum computing over classical computing and computers\nlies in the application of superpositioning concept by quantum\ncomputation as discussed earlier.\n\nLet's consider two systems, System A with 2 bits, and System B with 2\nqubits.\n\nSystem A can represent 4 different values , with 4 possible states of\n\\[00, 01, 10, 11\\]. The particular state-value for this system would be\n2⁰ bit0 + 2¹ bit1 . i.e. particular state-value ∈ {0,1,2,3}, one of the\n4 possible values. Now, consider System B. System B can represent\n**infinite different values formed from 4 different basis states**,00\n≡**\\|00⟩**, 01 ≡ **\\|01⟩**, 10 ≡ **\\|10⟩**, 11 ≡**\\|11⟩**. The possible\nstates being infinite, the particular state-value is α \\|00⟩ + β \\|01⟩ +\nγ \\|10⟩ + δ \\|11⟩, such that ***\\|*α\\|²+\\|β\\|² +\\|γ\\|² +\\|δ\\|² = 1**.\n\nThe key difference arises in the fact that System A requires knowing 2\nvalues, bit0 and bit1, in order to understand its states. On the other\nhand, System B requires knowing 4 values α, β, γ, δ. The implication of\nthis is addressed by the following excerpt:\n\nA n-bit classical system can be in one of the 2\\^n possible states at a\ntime, and all it needs is the value of these **n bits to be fully\nrecognized**\n\n**VS**\n\nA n-qubit system can be in **superposition** of all of those states 2\\^n\nstates at a given time and it needs the value of coefficients of all of\nthe **2\\^n states basis to be fully recognized**.\n\n**Note: To be more precise its 2\\^n -1, considering the summation to 1\nconstraint.**\n\nThus, because of the existence of superposition in the qubit system B,\nupto 2\\^n bit information can be stored in comparison to n-bit\ninformation in the classical bit system of classical computation. This\nfact is what gives Quantum Computers all its advantages over classical\ncomputers, and allows it to achieve larger and faster computations than\nclassical computers.\n\n## Problems that Quantum Computing can solve\n\nThere are many potential applications of quantum computing, some of\nwhich are:\n\n-   Quantum computing will very definitely make its mark felt in the\n    > **Encryption and Information Security** domain. RSA encryption has\n    > been quite reliable in encrypting large amounts of the world's\n    > data. However, a quantum computer could break RSA encryption with\n    > quite ease using Shor's algorithm. To address this, there has been\n    > discussion and initiative regarding using quantum computation to\n    > come up with more secure encryption methodologies.\n\n-   The domain of **Drug research and development** is a crucial\n    > applicable area for quantum computing. Drug testing and\n    > development involves computing various possibilities for variables\n    > within a chemical formula, which can be done faster and for larger\n    > datasets by a quantum computer, in comparison to classical\n    > computers.\n\n-   **Financial models** of financial markets depend on large amounts of\n    > datasets, and unrelenting amounts of variables and fluctuations.\n    > The usage of quantum computers, which can handle very large\n    > datasets and variability, can perhaps bring legibility to\n    > financial market modeling and forecasts.\n\n## Quantum computers/technologies already in use (2022)\n\n-   IBM Quantum leads the world in quantum computing. This nascent\n    > technology is widely expected to solve valuable problems that\n    > today's most powerful classical supercomputers cannot solve and\n    > never will.\n\n-   D-Wave Systems Inc. is a Canadian quantum computing company, based\n    > in Burnaby, British Columbia, Canada. D-Wave was the world\\'s\n    > first company to sell computers to exploit quantum effects in\n    > their operation.\n\n-   Azure Quantum is the cloud quantum computing service of Azure, with\n    > a diverse set of quantum solutions and technologies. Azure Quantum\n    > ensures an open, flexible, and future-proofed path to quantum\n    > computing that adapts to your way of working, accelerates your\n    > progress, and protects your technology investments.\n\n## Future scope and possibilities\n\nWith the growth in the population, and growing demands for energy and\nresources in the world, quantum computing can be used to arrive at more\nefficient ways to harness and distribute resources across the world.\nApplication of quantum computing into nonlinear problems makes it a\npotential game-changer for fields like cryptography, chemistry, material\nscience, agriculture, and pharmaceuticals once the technology is more\nmature. It also helps in issues pertaining to complex mathematical\nmodels.\n\nQuantum computation isn't suitable for all problems, it can help solve\nvarious issues in the future for which classical computers fall short.\nHowever, the list of potential application seems to be growing, with\nprotein modeling one of the newest scopes in a post-COVID-19 period.\n\nGood resource for learning quantum computing , its algorithms and\nprogramming in quantum computation:\n\n[[Resource]{.ul}](https://medium.com/@adubey40/quantum-computing-101-1ed742540ba2)\n(has been used as one of the references for this article as well)\n",
    "author": "Sanskar Pandey",
    "email": "sanskarpandey0@gmail.com",
    "date": "<02/10/2022>",
    "references": [
      "https://medium.com/@adubey40/quantum-computing-101-1ed742540ba2",
      "https://medium.com/@adubey40/qubit-61954c51afcd",
      "https://becominghuman.ai/quantum-superposition-and-what-that-means-to-quantum-computation-3fbb5a711b9a"
    ]
  }